Revit 2026 API

# FamilyInstanceSetCopingIds Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool SetCopingIds(
	ICollection<ElementId> cutters
)
```
```vb
Public Function SetCopingIds (
	cutters As ICollection(Of ElementId)
) As Boolean
```
```cpp
public:
bool SetCopingIds(
	ICollection<ElementId^>^ cutters
)
```
```fsharp
member SetCopingIds :
        cutters : ICollection<ElementId> -> bool
```

#### Parameters

cutters ICollectionElementId

#### Return Value

Boolean

#### Reference

FamilyInstance Class

Autodesk.Revit.DB Namespace